#+BEGIN_COMMENT
Copyright 2021-2025 Boris Shminke

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    https://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
#+END_COMMENT
* Basic usage example.
** In what case to use
This client might be useful if:

- you have a machine with Isabelle installed
- you have scripts for automatic generation of theory files in Python
- you want to communicate with the server not using [[https://scala-lang.org/][Scala]] and/or
  [[https://polyml.org/][Standard ML]]
** In what environment to use
The client works well in scripts and in Jupyter notebooks. For the
latter, one has to enable nested event loops first. Please refer to
~nest_asyncio~ [[https://pypi.org/project/nest-asyncio/][documentation]].
** Starting Isabelle server
First, we need to start an Isabelle server
#+begin_src python
  from isabelle_client import start_isabelle_server

  server_info, _ = start_isabelle_server(
      name="test", port=9999, log_file="server.log"
  )
#+end_src

#+RESULTS:

When using ~start_isabelle_server~ utility function in Python REPL or
terminal IPython, shutting the server down within the same session is
known to cause a runtime error on exit from the session. This
behaviour is related to a [[https://ipython.readthedocs.io/en/stable/interactive/autoawait.html#difference-between-terminal-ipython-and-ipykernel][well known issue]].

We could also start the server outside this script and use its info (on Windows, this is done in Cygwin)
#+begin_example
  isabelle server
#+end_example
** Interacting with Isabelle server
Let's create a client to our server
#+begin_src python
  from isabelle_client import get_isabelle_client

  isabelle = get_isabelle_client(server_info)
#+end_src

#+RESULTS:

We will log all the messages from the server to a file
#+begin_src python
  import logging

  isabelle.logger = logging.getLogger()
  isabelle.logger.setLevel(logging.INFO)
  isabelle.logger.addHandler(logging.FileHandler("session.log"))
#+end_src

#+RESULTS:

Isabelle client supports all the commands implemented in Isabelle server
#+begin_src python
  print(isabelle.help())
#+end_src

#+RESULTS:
: [HelpResult(response_type=<IsabelleResponseType.OK: 'OK'>, response_body=['cancel', 'echo', 'help', 'purge_theories', 'session_build', 'session_start', 'session_stop', 'shutdown', 'use_theories'], response_length=118)]

Let's suppose we have a ~Example.thy~ theory file in our working directory which we, e.g. generated with another Python script

#+INCLUDE: "../examples/Example.thy" example

First, we start a session:

#+begin_src python
  session_start_responses = isabelle.session_start()
  print(session_start_responses)
#+end_src

#+RESULTS:
: [TaskOK(response_type=<IsabelleResponseType.OK: 'OK'>, response_body=Task(task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=None), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Pure/Pure', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=117), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Misc/Tools', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=118), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session HOL/HOL (main)', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=122), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Doc/Main (doc)', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=122), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Pure/Pure', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=117), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Misc/Tools', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=118), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session HOL/HOL (main)', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=122), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Doc/Main (doc)', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=122), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Starting session Main ...', pos=None, task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd'), response_length=126), SessionStartRegularResponse(response_type=<IsabelleResponseType.FINISHED: 'FINISHED'>, response_body=SessionStartRegularResult(task='689b8a72-d2a8-4aff-bcb6-663cf60a2bcd', session_id='81da682a-dec6-4ae8-9d05-ae4ceeaa52ec', tmp_dir='/tmp/isabelle-boris/server_session10075248010333581955'), response_length=176)]

Then we can send this theory file to the server and get a response

#+begin_src python
  session_id = session_start_responses[-1].response_body.session_id
  print(isabelle.use_theories(
      session_id=session_id,
      theories=["Example"],
      master_dir="../examples"
  ))
#+end_src

#+RESULTS:
: [TaskOK(response_type=<IsabelleResponseType.OK: 'OK'>, response_body=Task(task='7a5d299d-b22c-49e7-81ec-e61eb45c3694'), response_length=None), TaskOK(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=Task(task='7a5d299d-b22c-49e7-81ec-e61eb45c3694'), response_length=161), TaskOK(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=Task(task='7a5d299d-b22c-49e7-81ec-e61eb45c3694'), response_length=161), TaskOK(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=Task(task='7a5d299d-b22c-49e7-81ec-e61eb45c3694'), response_length=163), UseTheoriesResponse(response_type=<IsabelleResponseType.FINISHED: 'FINISHED'>, response_body=UseTheoriesResults(ok=True, errors=[], nodes=[NodeResult(node_name='../examples/Example.thy', theory_name='Draft.Example', status=NodeStatus(ok=True, total=7, unprocessed=0, running=0, warned=0, failed=0, finished=7, canceled=False, consolidated=True, percentage=100), messages=[Message(kind='writeln', message='theorem \\<forall>x. \\<exists>y. x = y', pos=Position(line=5, offset=59, end_offset=61, file='../examples/Example.thy', id=None))], exports=[])]), response_length=482)]

or we can build a session document using ~./ROOT~ file

#+INCLUDE: "../examples/ROOT" example

and ~./document/root.tex~ file

#+INCLUDE: "../examples/document/root.tex" src tex

#+begin_src python
  import json

  print(
      isabelle.session_build(
          dirs=["../examples/"], session="examples"
      )
  )
#+end_src

#+RESULTS:
: [TaskOK(response_type=<IsabelleResponseType.OK: 'OK'>, response_body=Task(task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=None), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Pure/Pure', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=117), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Misc/Tools', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=118), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session HOL/HOL (main)', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=122), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Unsorted/examples', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=125), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Pure/Pure', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=117), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Misc/Tools', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=118), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session HOL/HOL (main)', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=122), NotificationResponse(response_type=<IsabelleResponseType.NOTE: 'NOTE'>, response_body=MessageNotification(kind='writeln', message='Session Unsorted/examples', pos=None, task='0b86e5dc-84e7-4900-b393-49d3d70ce721'), response_length=125), SessionBuildRegularResponse(response_type=<IsabelleResponseType.FINISHED: 'FINISHED'>, response_body=SessionBuildRegularResult(ok=True, return_code=0, sessions=[SessionBuildResult(session='Pure', ok=True, return_code=0, timeout=False, timing=Timing(elapsed=0.0, cpu=0.0, gc=0.0)), SessionBuildResult(session='HOL', ok=True, return_code=0, timeout=False, timing=Timing(elapsed=0.0, cpu=0.0, gc=0.0)), SessionBuildResult(session='examples', ok=True, return_code=0, timeout=False, timing=Timing(elapsed=0.0, cpu=0.0, gc=0.0))], task='0b86e5dc-84e7-4900-b393-49d3d70ce721', response_type=<IsabelleResponseType.FINISHED: 'FINISHED'>), response_length=396)]

One can also issue a free-form command, e.g.
#+begin_src python
  import asyncio

  print(asyncio.run(isabelle.execute_command("echo 42", asynchronous=False)))
#+end_src

#+RESULTS:
: [IsabelleResponse(response_type=<IsabelleResponseType.OK: 'OK'>, response_body=42, response_length=None)]

Finally, we can shut the server down.
#+begin_src python
  print(isabelle.shutdown())
#+end_src

#+RESULTS:
: [IsabelleResponse(response_type=<IsabelleResponseType.OK: 'OK'>, response_body='', response_length=None)]
